{
  "title": "Israel-Gaza War",
  "url": "https://www.bbc.com/news/topics/c2vdnvdg6xxt",
  "content": "News News Israel-Gaza war Aid group says worker killed by Israeli military in attack on Gaza HQ The Palestine Red Crescent Society accuses Israel of a \"direct\" strike - Israel says it is reviewing the claim. 4 hrs ago Middle East Government plans to bring more Gazan children to UK for treatment The government says it is working \"at pace\" on plans to evacuate seriously ill or injured children from Gaza. 6 hrs ago Middle East Hamas refuses to disarm until Palestinian state established Negotiations between Israel and Hamas for a ceasefire and the release of hostages stalled last week. 1 day ago Middle East \u0027Thank you, but it\u0027s too late\u0027: Why some Palestinians aren\u0027t convinced by Starmer\u0027s promise Some say Britain\u0027s decision is an important first step – while others worry it won\u0027t make a real difference, writes BBC\u0027s International Editor Jeremy Bowen. 2 days ago BBC InDepth Trump envoy visits controversial Gaza aid distribution site The visit with the IDF follows near daily reports of deadly shootings in the vicinity of the sites. 2 days ago World Government plans to bring more Gazan children to UK for treatment The government says it is working \"at pace\" on plans to evacuate seriously ill or injured children from Gaza. 6 hrs ago Middle East Family condemns Hamas video showing emaciated Israeli hostage Evyatar David\u0027s family says Hamas is starving him, as the group shows a video of him being kept in a tunnel. 11 hrs ago Middle East Tens of thousands turn out for Sydney pro-Palestinian march The Sydney Harbour Bridge was closed by the march, after it was authorised to go ahead by the Supreme Court hours earlier. 10 hrs ago World Hamas refuses to disarm until Palestinian state established Negotiations between Israel and Hamas for a ceasefire and the release of hostages stalled last week. 1 day ago Middle East Analysis What does recognising a Palestinian state mean? Prime Minister Sir Keir Starmer has announced that the UK will recognise a Palestinian state in September unless Israel meets certain conditions. The delicate politics behind the UK\u0027s move on Palestinian statehood The government\u0027s statehood policy marks a hugely significant shift in the UK\u0027s diplomatic stance. Bowen: Starmer\u0027s announcement a big change for British foreign policy PM Sir Keir Starmer has said the UK will recognise a Palestinian state in September unless Israel takes \"substantive steps to end the appalling situation in Gaza\". Watch: How did Gaza get to the brink of starvation? The BBC\u0027s diplomatic correspondent Paul Adams explains how the people of Gaza have reached a point of starvation. Bowen: Air dropping aid is an act of desperation that won\u0027t end hunger in Gaza Air drops can look good on television, but deliver very little aid and endanger civilian lives. Human stories Two girls shot in Gaza - BBC pieces together what happened and looks at dozens more child shootings Layan and Mira were killed in proximity to IDF soldiers - the Israeli military says intentional harm to civilians is prohibited and their cases will be examined by the authorities. Gazan boy first to be treated in UK for war injuries Majd, 15, was almost killed by an Israeli tank shell last February. He has finally arrived in the UK for reconstructive surgery. \u0027We need a real solution\u0027: Gazans welcome aid plan but fear it will not end crisis Israel says aid convoys will be allowed into Gaza, after weeks of mounting pressure and warnings of starvation. \u0027I\u0027m so tired\u0027: Mother of starving Gazan baby speaks to BBC Hedaya al-Muta\u0027wi\u0027s 18-month-old son Mohammed suffers from malnutrition due to famine, weighing just 6kg. He went to get aid and didn\u0027t come back - stories of people killed in Gaza As aid agencies warn of \"mass starvation\", the BBC hears from the relatives of some of those killed in the past week. Latest updates 4 hrs ago Aid group says worker killed by Israeli military in attack on Gaza HQ The Palestine Red Crescent Society accuses Israel of a \"direct\" strike - Israel says it is reviewing the claim. 4 hrs ago 6 hrs ago Government plans to bring more Gazan children to UK for treatment The government says it is working \"at pace\" on plans to evacuate seriously ill or injured children from Gaza. 6 hrs ago 10 hrs ago Tens of thousands turn out for Sydney pro-Palestinian march The Sydney Harbour Bridge was closed by the march, after it was authorised to go ahead by the Supreme Court hours earlier. 10 hrs ago 11 hrs ago Family condemns Hamas video showing emaciated Israeli hostage Evyatar David\u0027s family says Hamas is starving him, as the group shows a video of him being kept in a tunnel. 11 hrs ago 1 day ago Hamas refuses to disarm until Palestinian state established Negotiations between Israel and Hamas for a ceasefire and the release of hostages stalled last week. 1 day ago 1 day ago Pro-Palestinian protests disrupt FM\u0027s Fringe event The first minister said he believed Gaza was subject to \"a genocide\" after being heckled at the event. 1 day ago 2 days ago \u0027Thank you, but it\u0027s too late\u0027: Why some Palestinians aren\u0027t convinced by Starmer\u0027s promise Some say Britain\u0027s decision is an important first step – while others worry it won\u0027t make a real difference, writes BBC\u0027s International Editor Jeremy Bowen. 2 days ago 2 days ago Trump envoy visits controversial Gaza aid distribution site The visit with the IDF follows near daily reports of deadly shootings in the vicinity of the sites. 2 days ago 3 days ago Two girls shot in Gaza - BBC pieces together what happened and looks at dozens more child shootings Layan and Mira were killed in proximity to IDF soldiers - the Israeli military says intentional harm to civilians is prohibited and their cases will be examined by the authorities. 3 days ago ...",
  "summary": "News News Israel-Gaza war Aid group says worker killed by Israeli military in attack on Gaza HQ The Palestine Red Crescent Society accuses Israel of a \"direct\" strike - Israel says it is reviewing the claim 4 hrs ago Middle East Government plans to bring more Gazan children to UK for treatment The government says it is working \"at pace\" on plans to evacuate seriously ill or injured children from Gaza 2 days ago World Government plans to bring more Gazan children to UK for treatment The government says it is working \"at pace\" on plans to evacuate seriously ill or injured children from Gaza Latest updates 4 hrs ago Aid group says worker killed by Israeli military in attack on Gaza HQ The Palestine Red Crescent Society accuses Israel of a \"direct\" strike - Israel says it is reviewing the claim 2 days ago 3 days ago Two girls shot in Gaza - BBC pieces together what happened and looks at dozens more child shootings Layan and Mira were killed in proximity to IDF soldiers - the Israeli military says intentional harm to civilians is prohibited and their cases will be examined by the authorities",
  "category": "Trending",
  "source": "BBC",
  "publishedAt": "2025-08-04T01:00:08.6457632",
  "readingTimeSeconds": 58,
  "keyPoints": [
    "• News News Israel-Gaza war Aid group says worker killed by Israeli military in attack on Gaza HQ The Palestine Red Crescent Society accuses Israel of a \"direct\" strike - Israel says it is reviewing the claim",
    "• 4 hrs ago Middle East Government plans to bring more Gazan children to UK for treatment The government says it is working \"at pace\" on plans to evacuate seriously ill or injured children from Gaza",
    "• 2 days ago World Government plans to bring more Gazan children to UK for treatment The government says it is working \"at pace\" on plans to evacuate seriously ill or injured children from Gaza"
  ]
}